-- phpMyAdmin SQL Dump
-- version 4.9.7
-- https://www.phpmyadmin.net/
--
-- 主機： localhost:8889
-- 產生時間： 2021 年 05 月 04 日 08:50
-- 伺服器版本： 5.7.32
-- PHP 版本： 7.4.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `sddGame`
--

-- --------------------------------------------------------

--
-- 資料表結構 `sddGamehistory`
--

CREATE TABLE `sddGamehistory` (
  `id` int(100) NOT NULL,
  `gameType` varchar(999) DEFAULT NULL,
  `account` varchar(999) DEFAULT NULL,
  `betTime` varchar(999) DEFAULT NULL,
  `bets` decimal(13,4) NOT NULL,
  `object` varchar(999) DEFAULT NULL,
  `moneyBefore` decimal(13,4) DEFAULT NULL,
  `status` varchar(999) DEFAULT NULL,
  `result` decimal(13,4) DEFAULT NULL,
  `moneyAfter` decimal(13,4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `sddGamehistory`
--

INSERT INTO `sddGamehistory` (`id`, `gameType`, `account`, `betTime`, `bets`, `object`, `moneyBefore`, `status`, `result`, `moneyAfter`) VALUES
(59, NULL, 'steven', NULL, '200.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 100,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 100,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Cube,\n                        中獎大小：中小,\n                        中獎單雙：中雙,', '-200.0000', '9800.0000'),
(60, NULL, 'steven', NULL, '5100.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 5000,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 100,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Spades,\n                        中獎大小：中小,\n                        中獎單雙：中雙,', '-5100.0000', '4900.0000'),
(61, NULL, 'steven', NULL, '5100.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 0,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 5100,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Cube,\n                        中獎大小：中小,\n                        中獎單雙：中單,', '-5100.0000', '4900.0000'),
(62, NULL, 'steven', NULL, '5100.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 0,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 5100,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Plum,\n                        中獎大小：中大,\n                        中獎單雙：中雙,', '-5100.0000', '4900.0000'),
(63, NULL, 'steven', '2021-04-29T08:22:26.943Z', '200.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 0,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 200,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Cube,\n                        中獎大小：中小,\n                        中獎單雙：中單,', '-200.0000', '9800.0000'),
(64, '射龍門', 'steven', '2021-04-29T08:27:26.357Z', '1100.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 0,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 1100,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Cube,\n                        中獎大小：中大,\n                        中獎單雙：中雙,', '-1100.0000', '8900.0000'),
(65, '射龍門', 'steven', '2021-05-03T05:29:04.111Z', '1100.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 0,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 1100,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Cube,\n                        中獎大小：中小,\n                        中獎單雙：中單,', '-1100.0000', '8900.0000'),
(66, '射龍門', 'steven', '2021-05-03T12:37:25.267Z', '7100.0000', '\n      黑桃： 500,\n      大點： 1000,\n      中七： 0,\n      小點： 1000,\n      愛心： 500,\n      方塊： 500,\n      單數： 0,\n      龍門： 3100,\n      雙數： 0,\n      梅花： 500,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Heart,\n                        中獎大小：中小,\n                        中獎單雙：中單,', '-3175.0000', '6825.0000'),
(67, '射龍門', 'steven', '2021-05-03T13:42:41.913Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(68, '射龍門', 'steven', '2021-05-03T13:43:45.357Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(69, '射龍門', 'steven', '2021-05-03T13:43:45.357Z', '200.0000', '龍門： 200', '10000.0000', NULL, NULL, '9800.0000'),
(70, '射龍門', 'steven', '2021-05-03T13:58:13.096Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(71, '射龍門', 'steven', '2021-05-03T13:58:13.096Z', '200.0000', '龍門： 200', '10000.0000', NULL, NULL, '9800.0000'),
(72, '射龍門', 'steven', '2021-05-03T13:58:29.041Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(73, '射龍門', 'steven', '2021-05-03T13:59:33.817Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(74, '射龍門', 'steven', '2021-05-03T14:01:05.368Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(75, '射龍門', 'steven', '2021-05-03T14:01:08.616Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(76, '射龍門', 'steven', '2021-05-03T14:01:52.330Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(77, '射龍門', 'steven', '2021-05-03T14:01:56.450Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(78, '射龍門', 'steven', '2021-05-03T14:02:22.350Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(79, '射龍門', 'steven', '2021-05-03T14:04:28.949Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(80, '射龍門', 'steven', '2021-05-03T14:05:22.122Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(81, '射龍門', 'steven', '2021-05-03T14:06:13.026Z', '5100.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 0,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 5100,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：射過,\n                        中獎花色：Heart,\n                        中獎大小：中小,\n                        中獎單雙：中單,', '5100.0000', '15100.0000'),
(82, '射龍門', 'steven', '2021-05-03T14:06:33.709Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(83, '射龍門', 'steven', '2021-05-03T14:08:42.311Z', '100.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 0,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 100,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Cube,\n                        中獎大小：中小,\n                        中獎單雙：中雙,', '-100.0000', '9900.0000'),
(84, '射龍門', 'steven', '2021-05-03T14:09:30.297Z', '600.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 0,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 600,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Plum,\n                        中獎大小：中小,\n                        中獎單雙：中單,', '-600.0000', '9400.0000'),
(85, '射龍門', 'steven', '2021-05-03T18:49:23.198Z', '10100.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 0,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 10100,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：射過,\n                        中獎花色：Heart,\n                        中獎大小：中大,\n                        中獎單雙：中雙,', '10100.0000', '20100.0000'),
(86, '射龍門', 'steven', '2021-05-03T19:19:49.192Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(87, '射龍門', 'steven', '2021-05-03T19:25:40.172Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(88, '射龍門', 'steven', '2021-05-03T19:29:00.932Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(89, '射龍門', 'steven', '2021-05-03T19:29:02.663Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(90, '射龍門', 'steven', '2021-05-03T19:29:03.384Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(91, '射龍門', 'steven', '2021-05-03T19:29:17.893Z', '6100.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 1000,\n      小點： 1000,\n      愛心： 1000,\n      方塊： 1000,\n      單數： 1000,\n      龍門： 100,\n      雙數： 0,\n      梅花： 1000,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Cube,\n                        中獎大小：中大,\n                        中獎單雙：中雙,', '-2150.0000', '7850.0000'),
(92, '射龍門', 'steven', '2021-05-04T06:20:50.023Z', '5100.0000', '\n      黑桃： 0,\n      大點： 0,\n      中七： 5000,\n      小點： 0,\n      愛心： 0,\n      方塊： 0,\n      單數： 0,\n      龍門： 100,\n      雙數： 0,\n      梅花： 0,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Plum,\n                        中獎大小：中小,\n                        中獎單雙：中雙,', '-5100.0000', '4900.0000'),
(93, '射龍門', 'steven', '2021-05-04T08:18:48.442Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(94, '射龍門', 'steven', '2021-05-04T08:19:15.889Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(95, '射龍門', 'steven', '2021-05-04T08:19:23.135Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(96, '射龍門', 'steven', '2021-05-04T08:19:26.525Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(97, '射龍門', 'steven', '2021-05-04T08:20:38.906Z', '100.0000', '龍門： 100', '10000.0000', NULL, NULL, '9900.0000'),
(98, '射龍門', 'steven', '2021-05-04T08:24:46.879Z', '1000.0000', '\n      黑桃： 100,\n      大點： 100,\n      中七： 100,\n      小點： 100,\n      愛心： 100,\n      方塊： 100,\n      單數： 100,\n      龍門： 100,\n      雙數： 100,\n      梅花： 100,', '10000.0000', '幸運七：沒中,\n                        射龍門：射過,\n                        中獎花色：Cube,\n                        中獎大小：中小,\n                        中獎單雙：中雙,', '-25.0000', '9975.0000'),
(99, '射龍門', 'steven', '2021-05-04T08:31:40.634Z', '5600.0000', '\n      黑桃： 500,\n      大點： 0,\n      中七： 500,\n      小點： 0,\n      愛心： 0,\n      方塊： 500,\n      單數： 0,\n      龍門： 100,\n      雙數： 3500,\n      梅花： 500,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Plum,\n                        中獎大小：中大,\n                        中獎單雙：中單,', '-3625.0000', '6375.0000'),
(100, '射龍門', 'steven', '2021-05-04T08:46:58.832Z', '9100.0000', '\n      黑桃： 0,\n      大點： 4000,\n      中七： 0,\n      小點： 0,\n      愛心： 2000,\n      方塊： 1000,\n      單數： 0,\n      龍門： 100,\n      雙數： 0,\n      梅花： 2000,', '10000.0000', '幸運七：沒中,\n                        射龍門：沒射過,\n                        中獎花色：Spades,\n                        中獎大小：中大,\n                        中獎單雙：中雙,', '-1300.0000', '8700.0000');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `sddGamehistory`
--
ALTER TABLE `sddGamehistory`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `sddGamehistory`
--
ALTER TABLE `sddGamehistory`
  MODIFY `id` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
